<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5dd4bca2993f1d0c7231e56f30fb9bfbf6593270b6f36a75d8cc442193673098","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #555 at https://github.com/cal-itp/data-infra/actions/runs/17505293809","plan_out_hash":"29c8cb05fd999649cdc33b4b733b1b46b24da03fb85e87aa79bb27072827d004","plan_hash":"75709b2d7f087cf0337c040cbaddf0079c247fc92643c5ce9cc89e5104ac4d17","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/create_external_tables/ntd_data_products/historical__complete_monthly_ridership_with_adjustments_and_estimates.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/ntd_data_products/historical__complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/create_external_tables/ntd_data_products/historical__complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #555](https://github.com/cal-itp/data-infra/actions/runs/17505293809)